#+STARTUP: overview

My Emacs Init Settings

** Mode line
#+BEGIN_SRC emacs-lisp
  (defun my-get-and-parse-json (url)
    (let ((buffer (url-retrieve-synchronously url))
	  (json-object-type 'plist))
      (set-buffer buffer)
      (goto-char (point-min))
      (re-search-forward "^$") 
      (json-read-from-string
       (buffer-substring-no-properties (point) (point-max)))))

  ;; http://ip-api.com/json/
  (defun my-get-coordinate ()
    (let ((url "http://ip-api.com/json/"))
      (let ((data (my-get-and-parse-json url)))
	(list :lat (plist-get data :lat)
	      :lon (plist-get data :lon)))))

  ;; (defun my-get-coordinate ()
  ;;   (let* ((token "44cf10c96aeed5")
  ;; 	     (url (concat "https://ipinfo.io/json"
  ;; 			  "?"
  ;; 			  (url-build-query-string (list
  ;; 						   (list "token" token))))))
  ;; 	(let ((plist (my-get-and-parse-json url)))
  ;; 	  (let ((loc (plist-get plist :loc)))
  ;; 	    (-interleave '(:lat :lon) (split-string loc ","))))))

  (defun my-get-weather-info (coord)
    (let* ((openweathermapUrl "https://api.openweathermap.org/data/2.5/weather")
	   (appid "94f7172e9d0fd1e0c9756a48fa9c9477")
	   (lat (plist-get coord :lat))
	   (lon (plist-get coord :lon))
	   (url (concat openweathermapUrl
			"?"
			(url-build-query-string (list
						 (list "lat" lat)
						 (list "lon" lon)
						 (list "appid" appid)
						 (list "units" "metric"))))))
      (let ((data (my-get-and-parse-json url)))
	(list
	 :main (plist-get (aref (plist-get data :weather) 0) :main)
	 :temp (round (plist-get (plist-get data :main) :temp))))))

  (defvar my-weather-info-string nil)

  (defun my-display-weather-info ()
    (setq my-weather-info-string "")
    (or global-mode-string (setq global-mode-string '("")))
    (or (memq 'my-weather-info-string global-mode-string)
	(setq global-mode-string
	      (append global-mode-string '(my-weather-info-string))))
    (run-with-timer 0 (* 60 10)
		    (lambda ()
		      (let ((weather (my-get-weather-info (my-get-coordinate))))
			(setq my-weather-info-string (concat "[" 
							     (plist-get weather :main)
							     " "
							     (number-to-string (plist-get weather :temp))
							     "℃]"))
			(force-mode-line-update)))))

  (setq-default mode-line-format (-replace 'mode-line-modes " (%m) " mode-line-format))

  ;; (setq-default mode-line-format
  ;; 	'("%e"
  ;; 	  mode-line-front-space
  ;; 	  mode-line-mule-info
  ;; 	  mode-line-client
  ;; 	  mode-line-modified
  ;; 	  mode-line-remote
  ;; 	  mode-line-frame-identification
  ;; 	  mode-line-buffer-identification
  ;; 	  "   "
  ;; 	  mode-line-position
  ;; 	  (vc-mode vc-mode)
  ;; 	  "  "
  ;; 	  "(%m)"
  ;; 	  mode-line-misc-info
  ;; 	  "  "
  ;; 	  "[" my-mode-line-weather-info "]"
  ;; 	  mode-line-end-spaces))

  (my-display-weather-info)

#+END_SRC

#+RESULTS:
: [nil 23627 28384 919043 600 (lambda nil (let ((weather (my-get-weather-info (my-get-coordinate)))) (setq my-weather-info-string (concat "[" (plist-get weather :main) " " (number-to-string (plist-get weather :temp)) "℃]")) (force-mode-line-update))) nil nil 0]

